/*
 * Copyright 2011 Freescale Semiconductor, Inc. All Rights Reserved.
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */

#ifndef __ARCH_ARM_MACH_MX6_CCM_REGS_H__
#define __ARCH_ARM_MACH_MX6_CCM_REGS_H__

#define CCM_CCOSR		0x020c4060
#define CCM_CCGR0		0x020C4068
#define CCM_CCGR1		0x020C406c
#define CCM_CCGR2		0x020C4070
#define CCM_CCGR3		0x020C4074
#define CCM_CCGR4		0x020C4078
#define CCM_CCGR5		0x020C407c
#define CCM_CCGR6		0x020C4080

#define PMU_MISC2		0x020C8170

#ifndef __ASSEMBLY__
struct mxc_ccm_reg {
	u32 ccr;	/* 0x0000 */
	u32 ccdr;
	u32 csr;
	u32 ccsr;
	u32 cacrr;	/* 0x0010*/
	u32 cbcdr;
	u32 cbcmr;
	u32 cscmr1;
	u32 cscmr2;	/* 0x0020 */
	u32 cscdr1;
	u32 cs1cdr;
	u32 cs2cdr;
	u32 cdcdr;	/* 0x0030 */
	u32 chsccdr;
	u32 cscdr2;
	u32 cscdr3;
	u32 cscdr4;	/* 0x0040 */
	u32 resv0;
	u32 cdhipr;
	u32 cdcr;
	u32 ctor;	/* 0x0050 */
	u32 clpcr;
	u32 cisr;
	u32 cimr;
	u32 ccosr;	/* 0x0060 */
	u32 cgpr;
	u32 CCGR0;
	u32 CCGR1;
	u32 CCGR2;	/* 0x0070 */
	u32 CCGR3;
	u32 CCGR4;
	u32 CCGR5;
	u32 CCGR6;	/* 0x0080 */
	u32 CCGR7;
	u32 cmeor;
};

struct anatop_regs {
	mxs_reg_32(pll_arm);		/* 0x000 */
	mxs_reg_32(usb1_pll_480_ctrl);	/* 0x010 */
	mxs_reg_32(usb2_pll_480_ctrl);	/* 0x020 */
	mxs_reg_32(pll_528);		/* 0x030 */
	reg_32(pll_528_ss);		/* 0x040 */
	reg_32(pll_528_num);		/* 0x050 */
	reg_32(pll_528_denom);		/* 0x060 */
	mxs_reg_32(pll_audio);		/* 0x070 */
	reg_32(pll_audio_num);		/* 0x080 */
	reg_32(pll_audio_denom);	/* 0x090 */
	mxs_reg_32(pll_video);		/* 0x0a0 */
	reg_32(pll_video_num);		/* 0x0b0 */
	reg_32(pll_video_denom);	/* 0x0c0 */
	mxs_reg_32(pll_mlb);		/* 0x0d0 */
	mxs_reg_32(pll_enet);		/* 0x0e0 */
	mxs_reg_32(pfd_480);		/* 0x0f0 */
	mxs_reg_32(pfd_528);		/* 0x100 */
	mxs_reg_32(reg_1p1);		/* 0x110 */
	mxs_reg_32(reg_3p0);		/* 0x120 */
	mxs_reg_32(reg_2p5);		/* 0x130 */
	mxs_reg_32(reg_core);		/* 0x140 */
	mxs_reg_32(ana_misc0);		/* 0x150 */
	mxs_reg_32(ana_misc1);		/* 0x160 */
	mxs_reg_32(ana_misc2);		/* 0x170 */
	mxs_reg_32(tempsense0);		/* 0x180 */
